##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [23]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인

In [6]:
!pip install matplotlib
!pip install numpy

Requirement already satisfied: matplotlib in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (3.10.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (1.3.1)
Requirement already satisfied: cycler>=0.10 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (4.55.3)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (1.4.8)
Requirement already satisfied: numpy>=1.23 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (2.2.1)
Requirement already satisfied: packaging>=20.0 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (24.2)
Requirement already satisfied: pillow>=8 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (11.0.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (3.2.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Requirement already satisfied: numpy in c:\users\playdata\appdata\local\anaconda3\envs\pystudy_env\lib\site-packages (2.2.1)

In [5]:
#라이프로리 선언
import numpy as np
import pandas as pd

In [9]:

# 데이타 로드 선언
titanic_data = pd.read_csv('.//data/titanic .csv')

In [10]:
#재확인 
print(titanic_data.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

- 기초문제

In [11]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력

In [34]:
# 데이터 추가
titanic = pd.DataFrame({
                         'Status': ['Deceased', 'Survived'],
                         'Count': titanic_df['Survived'].value_counts().values
})
print(titanic)

     Status  Count
0  Deceased    549
1  Survived    342

In [12]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [25]:
# 2. 승객 나이의 평균 출력

In [15]:
average_age = titanic_data['Age'].mean()
average_age

np.float64(29.69911764705882)

In [26]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력

In [84]:
#운임기준으로 순위 계산
titanic_data['Rank'] = titanic_data['Fare'].rank(ascending=False).astype(int)
print(titanic_data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Rank
0        0         A/5 21171   7.2500   NaN        S   815
1        0          PC 17599  71.2833   C85        C   103
2        0  STON/O2. 3101282   7.9250   NaN        S   659
3        0            113803  53.1000  C123        S   144
4        0            373450   8.0500   NaN        S   628
..     ...               ...      ...   ...      ...   ...
886      0            211536  13.0000   NaN        S   484
887      0            112053  30.0000   B42        S   237
888      2        W./C. 6607  23.4500   NaN        S   345
889      0            111369  30.0000  C148        C   237
890      0            370376   7.7500   NaN        Q   768

[891 rows x 13 columns]

In [85]:
#Rank 기준으로 데이터 정렬
ranked_data = titanic_data.sort_values('Rank')
ranked_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Rank
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,2
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,2
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,2
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S,5
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,5

In [95]:
# 4. 여성 승객의 수를 구하여 출력

In [97]:
female_count = titanic_data[titanic_data['Sex'] == 'female'].shape[0]
female_count

314

In [88]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력

In [100]:
hf = titanic_data.loc[titanic_data['Fare'] >= 50, ['Name', 'Fare']]
hf.head()

                                                 Name      Fare
1   Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                             McCarthy, Mr. Timothy J   51.8625
27                     Fortune, Mr. Charles Alexander  263.0000
31     Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208

In [29]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력

In [112]:
kids = titanic_data[titanic_data['Age'] < 18]
surv_rate = kids['Survived'].mean()
surv_rate

np.float64(0.5398230088495575)

In [30]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력

In [113]:
# 평균 운임 계산 (2등급 객실)
p2_fare = titanic_data[titanic_data['Pclass'] == 2]['Fare'].mean()
p2_fare

np.float64(20.662183152173913)

In [31]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력

In [114]:
# 나이가 가장 많은 승객의 이름과 나이
oldest = titanic_data.loc[titanic_data['Age'].idxmax(), ['Name', 'Age']]
oldest

Name    Barkworth, Mr. Algernon Henry Wilson
Age                                     80.0
Name: 630, dtype: object

In [32]:
# 9. S 항구에서 탑승한 승객의 수를 출력

In [130]:
s_count = titanic_data[titanic_data['Embarked'] == 'S'].shape[0]
s_count

644

In [146]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력

In [ ]:
# 3등급 객실에 탑승한 남성 승객 중 생존자의 수 계산
p3_male_survived = titanic_data[(titanic_data['Pclass'] == 3) & (titanic_data['Sex'] == 'male') & (titanic_data['Survived'] == 1)].shape[0]
p3_male_survived

- 고급문제

In [317]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

In [318]:
# 생존자와 비생존자의 객실 등급별 평균 나이 계산
avg_age = titanic_data.groupby(['Survived', 'Pclass'])['Age'].mean()
avg_age

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

In [319]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력

In [320]:
filt = titanic_data[titanic_data['SibSp'] >= 3]
top = filt.nlargest(5, 'Fare')


res = top[['Name', 'Age']]

# 4단계: 결과 출력
print(res)

                               Name   Age
27   Fortune, Mr. Charles Alexander  19.0
88       Fortune, Miss. Mabel Helen  23.0
341  Fortune, Miss. Alice Elizabeth  24.0
159      Sage, Master. Thomas Henry   NaN
180    Sage, Miss. Constance Gladys   NaN

In [36]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

In [176]:
#결측치
nan_age = titanic_data[titanic_data['Age'].isna()]

In [321]:
#분포 계산
embarked_dist = nan_age['Embarked'].value_counts()
print(embarked_dist)

Embarked
S    90
Q    49
C    38
Name: count, dtype: int64

In [37]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

In [322]:
solo = titanic_data[(titanic_data['Age'] < 16) & 
                    (titanic_data['SibSp'] == 0) & 
                    (titanic_data['Parch'] == 0)]

In [323]:
result = solo[['Name', 'Sex', 'Survived']]
print(result)

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [38]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

In [325]:
#등급이 1등급
class1 = titanic_data[titanic_data['Pclass'] == 1]
#평균운입계산
avg_fare = class1['Fare'].mean()
#평균운임이 높은 사람
high_fare = class1[class1['Fare'] > avg_fare]
#이름, 나이, 운임 선택
result = high_fare[['Name', 'Age', 'Fare']]
print(result)

                                                  Name   Age      Fare
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)   NaN  146.5208
88                          Fortune, Miss. Mabel Helen  23.0  263.0000
118                           Baxter, Mr. Quigg Edmond  24.0  247.5208
195                               Lurette, Miss. Elise  58.0  146.5208
..                                                 ...   ...       ...
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  43.0  211.3375
802                Carter, Master. William Thornton II  11.0  120.0000
820  Hays, Mrs. Charles Melville (Clara Jennings Gr...  52.0   93.5000
849       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)   NaN   89.1042
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667

[66 rows x 3 columns]

In [39]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

In [326]:
#결측치제거
data = titanic_data.dropna(subset=['Age', 'Pclass', 'Fare'])
print(data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
885          886         0       3
886          887         0       2
887          888         1       1
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  Rank
0        0         A/5 21171   7.2500   NaN        S   815
1        0          PC 17599  71.2833   C85        C   103
2        0  STON/O2. 3101282   7.9250   NaN        S   659
3        0            113803  53.1000  C123        S   144
4        0            373450   8.0500   NaN        S   628
..     ...               ...      ...   ...      ...   ...
885      5            382652  29.1250   NaN        Q   246
886      0            211536  13.0000   NaN        S   484
887      0            112053  30.0000   B42        S   237
889      0            111369  30.0000  C148        C   237
890      0            370376   7.7500   NaN        Q   768

[714 rows x 13 columns]

In [327]:
# 평균과 중앙값 계산
stats = data.groupby('Pclass')['Fare'].agg(['mean', 'median'])
print(stats)

             mean   median
Pclass
1       87.961582  69.3000
2       21.471556  15.0458
3       13.229435   8.0500

In [40]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

In [328]:
#평균 나이 계산
avg_age = titanic_data.groupby('Embarked')['Age'].mean()
print("Embarked 별 평균 나이:")
print(avg_age)

Embarked 별 평균 나이:
Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64

In [329]:
#가장 많은 승객이 탑승한 항구 확인
top_port = titanic_data['Embarked'].mode()[0]
print(f"가장 많은 승객이 탑승한 항구: {top_port}")

가장 많은 승객이 탑승한 항구: S

In [330]:
#해당 항구의 생존율 계산
surv_rate = titanic_data[titanic_data['Embarked'] == top_port]['Survived'].mean()
print(f"{top_port} 항구의 생존율: {surv_rate* 100:.2f}%")

S 항구의 생존율: 33.70%

In [41]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

In [331]:
#여성이면서 30세이상
fem_30 = titanic_data[(titanic_data['Sex'] == 'female')
                      & (titanic_data['Age'] >= 30)]

# 생존율 계산
surv_rate = fem_30['Survived'].mean()

#
print(f"생존율: {surv_rate * 100:.2f}%")

생존율: 80.70%

In [42]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

In [332]:
# 조건에 맞는 승객
fam = titanic_data[(titanic_data['SibSp']
                    + titanic_data['Parch']) >= 3]
# 생존율 계산
rate = fam['Survived'].mean()

# 결과 출력
print(f"생존율: {rate * 100:.2f}%")

생존율: 34.07%

In [43]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력

In [336]:
rate = filtered_df.groupby('Pclass')['Survived'].mean() * 100

In [337]:
rate = rate.round(2).astype(str) + '%'
rate

Pclass
1    66.48%
2    81.25%
3     50.0%
Name: Survived, dtype: object